app/views/devis/templates/_form.html.erb

SELECT "informations".* FROM "informations"
---
    <ul id='id_information_general'>
	    <% Information.all.each do |information| %>

SELECT "informationlignes".* FROM "informationlignes" WHERE "informationlignes"."devi_id" = 5 AND "informationlignes"."information_id" = 1 ORDER BY position LIMIT 1
SELECT "informations".* FROM "informations" WHERE "informations"."id" = 1 LIMIT 1
---
			         <ol id='informationlignes_informations_<%= information.id %>' class='informationlignes'>
				   <% @devi.informationlignes.find(:all, :conditions=>{:information_id=>information.id}, :order => "position").each{ |informationligne| %>

SELECT "titleinformationlignes".* FROM "titleinformationlignes" WHERE "titleinformationlignes"."information_id" = 1 AND "titleinformationlignes"."devi_id" = 8 AND "titleinformationlignes"."informationligne_id" = 0
---
						     <ul id="id_ul_informationligne_<%= informationligne.id %>">
						    	<% informationligne.titleinformationlignes.each{ |titleinformationligne| %>

SELECT COUNT(*) FROM "titleinformationlignes" WHERE "titleinformationlignes"."information_id" = 1
---
				</table>
			    <% unless information.titleinformationlignes.empty? || @devi.informationlignes.find(:first, :conditions=>{:information_id=>information.id}, :order => "position").nil? %>

SELECT "lignedevis".* FROM "lignedevis" WHERE "lignedevis"."devi_id" = 5
SELECT COUNT(*) FROM "lignedevis" WHERE "lignedevis"."devi_id" = 1
---
				</tr>
				<% unless @devi.lignedevis.empty? %>