app/views/factures/index.html.erb

SELECT "devis".* FROM "devis" WHERE "devis"."id" = ? LIMIT 1  [["id", "11"]]
SELECT "factures".* FROM "factures" WHERE "factures"."devi_id" = 11 AND ("factures"."created_at" BETWEEN '2014-01-01 00:00:00' AND '2015-01-01 00:00:00') ORDER BY numfacture
---
<%= link_to "Téléchargements des factures", "/allfactures" %>
<h1>Liste des factures <%= params[:devi_id].nil? ? "" : "correspondant au devis #{Devi.find(params[:devi_id]).numdevis}" %><%= params[:devi_id].nil? ? (params[:client_id].nil? ? link_to("<", :controller=>"factures" ,:action=>"index", :year=>(params[:year].nil? ? Time.now().strftime("%Y").to_i - 1 : params[:year].to_i - 1)) : link_to("<", :controller=>"factures" ,:action=>"index", :year=>(params[:year].nil? ? Time.now().strftime("%Y").to_i - 1 : params[:year].to_i - 1), :client_id=>params[:client_id])) : link_to("<", :controller=>"factures" ,:action=>"index", :year=>(params[:year].nil? ? Time.now().strftime("%Y").to_i - 1 : params[:year].to_i - 1), :devi_id=>params[:devi_id]) %> <%= params[:year].nil? ? Time.now().strftime("%Y") : params[:year].to_i %> <%= !params[:year].nil? && Time.now.strftime("%Y").to_i != params[:year].to_i ? (params[:devi_id].nil? ? (params[:client_id].nil? ? link_to(">", :controller=>"factures", :action=>"index", :year=>(params[:year].to_i + 1)) : link_to(">", :controller=>"factures", :action=>"index", :year=>(params[:year].to_i + 1), :client_id=>params[:client_id])) : link_to(">", :controller=>"factures", :action=>"index", :year=>(params[:year].to_i + 1))) : "" %></h1>