app/views/factures/templates/_tab_liste_factures.html.erb

SELECT "devis".* FROM "devis" WHERE "devis"."id" = ? LIMIT 1  [["id", "11"]]
---
    <td style='<%= facture.accompte != 100 ? 'background-color:#FEF680;' : "" %>;padding-left:5px;'><%= facture.accompte %> %</td>
    <td><%= facture.devi.description.nil? || facture.devi.description.empty? ? "" : "#{facture.devi.description.slice(0..20)}..." %></td>