app/controllers/clients_controller.rb

  def index
    @clients = Client.order(:nameentreprise)
---
SELECT "clients".* FROM "clients" ORDER BY nameentreprise

  def edit
    @client = Client.find(params[:id])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    #params[:client][:numclient] = Client.maximum('numclient').nil? ? 1 : Client.maximum('numclient').to_i + 1
    @client = Client.new(params[:client])

    #respond_to do |format|
      if @client.save
---
INSERT INTO "clients" ("adresse", "affacturage", "created_at", "nameentreprise", "namerefcontact", "numclient", "tva_intra", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @client = Client.find(params[:id])

    #respond_to do |format|
    #  if @client.update_attributes(params[:client])
    #    format.html { redirect_to(@client, :notice => 'Client was successfully updated.') }
    #    format.xml  { head :ok }
    #  else
    #    format.html { render :action => "edit" }
    #    format.xml  { render :xml => @client.errors, :status => :unprocessable_entity }
    #  end
    #end
    if @client.update_attributes(params[:client])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "clients" SET "numclient" = 1, "adresse" = 'Gerard-cayla@wanadoo.fr', "updated_at" = '2014-08-08 17:24:41.407394' WHERE "clients"."id" = 1