app/controllers/devis_controller.rb

  def index
    @total_get_ht = 0
    @total_devi_attente = 0
    unless params[:client_id].nil?
    	@devis = Devi.where(:created_at=>Time.local(params[:year].nil? ? Time.now.strftime("%Y").to_i : params[:year].to_i,1,1,0,0,0).strftime("%Y-%m-%d %H:%M:%S")..Time.local((params[:year].nil? ? Time.now.strftime("%Y").to_i : params[:year].to_i)+1,1,1,0,0,0).strftime("%Y-%m-%d %H:%M:%S"), :client_id=>params[:client_id]).order(:numdevis).all
---
SELECT "devis".* FROM "devis" WHERE "devis"."client_id" = 1 AND ("devis"."created_at" BETWEEN '2014-01-01 00:00:00' AND '2015-01-01 00:00:00') ORDER BY numdevis

  def show
    @totalsumgeneral = 0
    @hash_totalsnumgeneral = Hash.new
    #@devi = Devi.find(:first, :conditions=>{:id=>params[:id_devi], :numdevis=>params[:id]})
    @devi = Devi.where(:id => params[:id_devi], :numdevis => params[:id]).first
---
SELECT "devis".* FROM "devis" WHERE "devis"."id" = 11 AND "devis"."numdevis" = 'D0001-2014' LIMIT 1

  def new
    #@devi = Devi.new
   if params[:devi_id_copy].nil?
	@devi = Devi.new(:client_id=>params[:client_id].to_i, :numdevis=>get_numdevis)
    	@devi.save
    	redirect_to edit_devi_path(@devi)
   else
	@devi_find = Devi.find(params[:devi_id_copy])
---
INSERT INTO "devis" ("client_id", "cond_payment", "created_at", "description", "etat", "numdevis", "tva", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "devis".* FROM "devis" WHERE (created_at >= '2014-01-01 00:00:00')

  def edit
    @totalsumgeneral = 0
    @hash_totalsnumgeneral = Hash.new
    @devi = Devi.find(params[:id])
---
SELECT "devis".* FROM "devis" WHERE "devis"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @devi = Devi.find(params[:id])

    #respond_to do |format|
     # if @devi.update_attributes(params[:devi])
      #  format.html { redirect_to(@devi, :notice => 'Devi was successfully updated.') }
       # format.xml  { head :ok }
      #else
       # format.html { render :action => "edit" }
       # format.xml  { render :xml => @devi.errors, :status => :unprocessable_entity }
      #end
    #end
   if @devi.update_attributes(params[:devi])
---
SELECT "devis".* FROM "devis" WHERE "devis"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "devis" SET "description" = 'Developoppement de site internet de gestion de location', "updated_at" = '2014-08-10 07:38:29.853260' WHERE "devis"."id" = 11

  def destroy
    @devi = Devi.find(params[:id])
    flash[:notice] = @devi.destroy ? "La supression de ce devi s'est bien déroulé, il n'est plus disponible" : "La supression de ce devi ne s'est pas déroulé correctement, il est encore disponible"
---
SELECT "devis".* FROM "devis" WHERE "devis"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "devis" WHERE "devis"."id" = ?  [["id", 12]]

  def set_params(params)
	if params.split("_").length-1 == 5
	   case params.split("_")[0]
	      when "add"
		information_id = params.split("_")[3]
		devi_id = params.split("_")[5]
		unite = information_id.to_i == 1 || information_id.to_i == 4 ? "pce" : "j"
		informationligne = Informationligne.new(:devi_id=>devi_id, :information_id=>information_id, :unite=>unite)
		informationligne.save
	      when "sup"
		informationligne_id = params.split("_")[5]
		informationligne = Informationligne.find(informationligne_id)
 		informationligne.destroy
	      when "addlignetotal"
		devi_id = params.split("_")[5]
		lignedevi = Lignedevi.new(:name=>"", :prix=>0, :devi_id=>devi_id)
		lignedevi.save
	      when "suplignedevi"
		lignedevi_id = params.split("_")[5]
		lignedevi = Lignedevi.find(lignedevi_id)
		lignedevi.destroy
	      when "addtitre"
	      	information_id = params.split("_")[3].to_i
		devi_id = params.split("_")[5].to_i
		titleinformationligne = Titleinformationligne.new(:title=>"title by default", :information_id=>information_id, :devi_id=>devi_id)
		titleinformationligne.save
	      when "suptitre"
		titleinformationligne_id = params.split("_")[3]
		titleinformationligne = Titleinformationligne.find(titleinformationligne_id)
		titleinformationligne.delete
---
INSERT INTO "informationlignes" ("devi_id", "information_id", "name", "number", "position", "price", "unite") VALUES (?, ?, ?, ?, ?, ?, ?)  [["devi_id", 8], ["information_id", 1], ["name", nil], ["number", 0.0], ["position", nil], ["price", 0.0], ["unite", "pce"]]
SELECT "informationlignes".* FROM "informationlignes" WHERE "informationlignes"."devi_id" = 5 AND "informationlignes"."information_id" = 1 ORDER BY position LIMIT 1
DELETE FROM "informationlignes" WHERE "informationlignes"."id" = ?  [["id", 14]]
INSERT INTO "lignedevis" ("devi_id", "name", "prix") VALUES (?, ?, ?)  [["devi_id", 5], ["name", ""], ["prix", 0.0]]
SELECT "lignedevis".* FROM "lignedevis" WHERE "lignedevis"."devi_id" = 5 AND "lignedevis"."id" IN (1)
DELETE FROM "lignedevis" WHERE "lignedevis"."id" = ?  [["id", 1]]
INSERT INTO "titleinformationlignes" ("created_at", "devi_id", "font_size", "font_weight", "information_id", "informationligne_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "titleinformationlignes".* FROM "titleinformationlignes" WHERE "titleinformationlignes"."information_id" = 1 AND "titleinformationlignes"."devi_id" = 8 AND "titleinformationlignes"."informationligne_id" = 0
DELETE FROM "titleinformationlignes" WHERE "titleinformationlignes"."id" = 2