app/controllers/factures_controller.rb

SELECT "factures".* FROM "factures" WHERE "factures"."devi_id" = 11 AND ("factures"."created_at" BETWEEN '2014-01-01 00:00:00' AND '2015-01-01 00:00:00') ORDER BY numfacture
---
  def index
   @total_facture_ht = 0
   @total_facture_ttc = 0
   @total_facture_attente_paiement_ht = 0
   @total_facture_attente_paiement_ttc = 0
   @total_facture_paiement_ht = 0
   @total_facture_paiement_ttc = 0
   @total_facture_paye = 0
   unless params[:client_id].nil?
    #@factures = Facture.joins(:devi).where(:devis => {:client_id=>params[:client_id]}).order(:numfacture)
    @factures = Facture.joins(:devi).where(:created_at=>Time.local(params[:year].nil? ? Time.now.strftime("%Y").to_i : params[:year].to_i,1,1,0,0,0).strftime("%Y-%m-%d %H:%M:%S")..Time.local((params[:year].nil? ? Time.now.strftime("%Y").to_i : params[:year].to_i)+1,1,1,0,0,0).strftime("%Y-%m-%d %H:%M:%S"), :devis => {:client_id=>params[:client_id]}).order(:numfacture)
    #@factures = Facture.where("created_at between :last_year and :first_year and proforma='f' and annulation='f'",{:first_year=>Time.local(@year_params+1,1,1,0,0,0).strftime("%Y-%m-%d %H:%M:%S"), :last_year=>Time.local(@year_params,1,1,0,0,0).strftime("%Y-%m-%d %H:%M:%S")}).all
   else
 	unless params[:devi_id].nil?
		@factures = Facture.where(:created_at=>Time.local(params[:year].nil? ? Time.now.strftime("%Y").to_i : params[:year].to_i,1,1,0,0,0).strftime("%Y-%m-%d %H:%M:%S")..Time.local((params[:year].nil? ? Time.now.strftime("%Y").to_i : params[:year].to_i)+1,1,1,0,0,0).strftime("%Y-%m-%d %H:%M:%S"), :devi_id => params[:devi_id]).order(:numfacture)

SELECT "factures".* FROM "factures" WHERE "factures"."numfacture" = 'F0001-2014' AND "factures"."id" = 1 LIMIT 1
---
  def show
   if request.url != "/allfactures" && (request.url == "/rapports" || request.url == "/downloadrapports" || request.url.scan(/^(.{1,})?\?.{1,}?$/)[0][0] == "/rapports" || request.url.scan(/^(.{1,})?\?.{1,}?$/)[0][0] == "/downloadrapports")
   	#Time.local(2011,1,1,0,0,0)
	@hash_name_client = Hash.new
	@hash_name_client_facture_encaisse = Hash.new
	@tab_result_facture_ttc_ht_by_month = Array.new
	@tab_result_facture_encaisse_ttc_ht_by_month = Array.new
	@tab_result_facture_ttc_ht = Array.new
	@tab_result_facture_encaisse_ttc_ht = Array.new
	@tab_facture_name_client = Array.new
	@total_facture_ht = 0
	@total_facture_ttc = 0
   	@total_facture_attente_paiement_ht = 0
   	@total_facture_attente_paiement_ttc = 0
	@total_facture_paiement_ht = 0
	@total_facture_paiement_ttc = 0
	@time_now = Time.now
	@year_params = (params[:year].nil? ? @time_now.strftime("%Y").to_i : params[:year].to_i)
	@factures = Facture.where("created_at between :last_year and :first_year and proforma='f' and annulation='f'",{:first_year=>Time.local(@year_params+1,1,1,0,0,0).strftime("%Y-%m-%d %H:%M:%S"), :last_year=>Time.local(@year_params,1,1,0,0,0).strftime("%Y-%m-%d %H:%M:%S")}).all
  	@factures_encaisses = Facture.where("datepaiement between :last_year and :first_year and created_at <= :time_now and proforma='f' and annulation='f' and datepaiementcheck='t'",{:first_year=>Time.local(@year_params+1,1,1,0,0,0).strftime("%Y-%m-%d %H:%M:%S"), :last_year=>Time.local(@year_params,1,1,0,0,0).strftime("%Y-%m-%d %H:%M:%S"),:time_now=>@time_now.strftime("%Y-%m-%d %H:%M:%S")})
   else
      unless request.url == "/allfactures"
    	@totalsumgeneral = 0
    	@hash_totalsnumgeneral = Hash.new
    	@facture = Facture.where(:numfacture=>params[:id], :id=>params[:facture_id]).first

SELECT "devis".* FROM "devis" WHERE "devis"."id" = ? LIMIT 1  [["id", 11]]
INSERT INTO "factures" ("accompte", "annulation", "choixrib", "cond_reglement", "created_at", "datepaiement", "datepaiementcheck", "devi_id", "numcommande", "numfacture", "proforma", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def new
    devi = Devi.find(params[:devi_id].to_i)
    @facture = Facture.new(:devi_id=>params[:devi_id], :numfacture=>get_numfacture, :choixrib=>(devi.client.affacturage ? "factobail" : "rib"))
    @facture.save

SELECT "factures".* FROM "factures" WHERE "factures"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @facture = Facture.find(params[:id])

SELECT "factures".* FROM "factures" WHERE "factures"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "factures" SET "numcommande" = 'test', "created_at" = '2014-09-14 00:00:00.000000', "datepaiement" = '2014-09-14 00:00:00.000000', "updated_at" = '2014-09-14 16:20:35.948087' WHERE "factures"."id" = 1
---
  def update
    @facture = Facture.find(params[:id])

    #respond_to do |format|
     # if @facture.update_attributes(params[:facture])
      #  format.html { redirect_to(@facture, :notice => 'Facture was successfully updated.') }
       # format.xml  { head :ok }
      #else
       # format.html { render :action => "edit" }
       # format.xml  { render :xml => @facture.errors, :status => :unprocessable_entity }
      #end
    #end
    	#params[:facture][:datepaiement] = Time.now - @facture.created_at unless params[:facture][:datepaiementcheck]
    if @facture.update_attributes(params[:facture])